The type of structural section shape.
  Namespace:   Autodesk.Revit.DB.Structure.StructuralSections
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public StructuralSectionShape StructuralSectionShape { get; }
  Visual Basic
Public ReadOnly Property StructuralSectionShape As StructuralSectionShape
	Get
  Visual C++
public:
property StructuralSectionShape StructuralSectionShape {
	StructuralSectionShape get ();
}
 See Also
  StructuralSection Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace